Revit 2021.1 API
Units.GetFormatOptions Method (ForgeTypeId)
 Gets the default FormatOptions for a spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
public FormatOptions GetFormatOptions(
	ForgeTypeId specTypeId
)
Visual Basic
Public Function GetFormatOptions ( _
	specTypeId As ForgeTypeId _
) As FormatOptions
Visual C++
public:
FormatOptions^ GetFormatOptions(
	ForgeTypeId^ specTypeId
)
Parameters
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the spec.
Return Value
 A copy of the FormatOptions.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  specTypeId is not a spec identifier. See UnitUtils.IsSpec(ForgeTypeId) and UnitUtils.GetSpecTypeId(UnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Units Class
GetFormatOptions Overload
Autodesk.Revit.DB Namespace